document.getElementsByClassName("pictures").onclick = f0

function description(surname) {
    switch (surname){
        case "Aleksandrova":
            alert("Доброжелательная и жизнерадостная. Никогда не падает духом, даже в экстремальных ситуациях.")
            break;
        case "Batueva":
            alert("Самый прямолинейный человек, который всегда говорит то, что думает. Переубедить ее в чем-либо очень сложно. Мечтает об удачном поступлении и прилагает к этому все усилия. Постоянный поставщик вкусно пахнущих кремов и духов. Не боится быть смешной.")
            break;
        case "Belosludceva":
            alert("Душевная, целеустремленная, старательная, добрая, терпеливая. Пример для подражания в учебе.")
            break;
        case "Bogatyreva":
            alert("Понять её до конца, наверно, еще никому не давалось. Безумно наивная, но местами хитрая девушка. А вспоминать её будем только с улыбкой.")
            break;
        case "Zubkova":
            alert("Целеустремленная и амбициозная девушка. Лидер по жизни, поэтому она не привыкла проигрывать. Любит изучать мир и находить что-то новое. Дорожит близкими людьми. Всегда готова прийти на помощь.")
            break;
        case "Ibragimova":
            alert("Очень загадочная, до конца не раскрывшаяся девушка, но в душе очень добрая. Если узнать ее поближе, то она очень общительный и веселый человек. Как истинная леди она никогда не опаздывает, а просто задерживается.")
            break;
        case "Ivanov":
            alert("Стоит ему засмеяться или засмущаться – краснеет как бурак. Не лишен чувства юмора, дружелюбный. Любитель столовских булочек. Быстрый как молния - это про него. Смекалистый, но уж очень палевный.")
            break;
        case "Islamova":
            alert("Человек с ярко выраженными лидерскими качествами. Умеет сплотить и направить деятельность коллектива в нужное русло. Неординарная и активная девушка. Заражает всех позитивом.")
            break;
        case "Kargapolceva":
            alert("Строгая, умная и властолюбивая. Не может жить без музыки. Любит смотреть фильмы и сериалы, читать книги. Увлекается волейболом.")
            break;
        case "Lazareva":
            alert("Любопытная, прямолинейная, честная, способная, творческая, самоуверенная. Её основное занятие – это творчество. Не важно, в чем и как, главное – творить.")
            break;
        case "Maslennikov":
            alert("Лентяй – перфекционист. Его раздражает бардак, но ему лень его убирать. Любит хорошую музыку и обаятельных людей.")
            break;
                        
    }
}